#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.infrastructure.module.container_registries.helm_release.ecr_cred_refresher_default["content"] will be created
  + resource "helm_release" "ecr_cred_refresher_default" {
      + atomic                     = false
      + chart                      = "aws-ecr-credential"
      + cleanup_on_fail            = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "ecr-cred-refresher-default"
      + namespace                  = "ecrcredrefresh"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://architectminds.github.io/helm-charts/"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.4.2"
      + wait                       = true

      + set {
          + name  = "aws.region"
          + value = "us-west-2"
        }
      + set {
          + name  = "targetNamespace"
          + value = "content"
        }

      + set_sensitive {
          + name  = "aws.accessKeyId"
          + value = (sensitive value)
        }
      + set_sensitive {
          + name  = "aws.account"
          + value = (sensitive value)
        }
      + set_sensitive {
          + name  = "aws.secretAccessKey"
          + value = (sensitive value)
        }
    }

  # module.infrastructure.module.container_registries.helm_release.ecr_cred_refresher_default["default"] will be created
  + resource "helm_release" "ecr_cred_refresher_default" {
      + atomic                     = false
      + chart                      = "aws-ecr-credential"
      + cleanup_on_fail            = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "ecr-cred-refresher-default"
      + namespace                  = "ecrcredrefresh"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://architectminds.github.io/helm-charts/"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.4.2"
      + wait                       = true

      + set {
          + name  = "aws.region"
          + value = "us-west-2"
        }
      + set {
          + name  = "targetNamespace"
          + value = "default"
        }

      + set_sensitive {
          + name  = "aws.accessKeyId"
          + value = (sensitive value)
        }
      + set_sensitive {
          + name  = "aws.account"
          + value = (sensitive value)
        }
      + set_sensitive {
          + name  = "aws.secretAccessKey"
          + value = (sensitive value)
        }
    }

  # module.infrastructure.module.container_registries.kubernetes_namespace.ecr_cred_refresher will be created
  + resource "kubernetes_namespace" "ecr_cred_refresher" {
      + id = (known after apply)

      + metadata {
          + annotations      = {
              + "name" = "ecrcredrefresh"
            }
          + generation       = (known after apply)
          + name             = "ecrcredrefresh"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `Test infrastructure plan`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`, Workspace: `default`*
